## understanding Your Data

## 1. Asking Basic Question
## 2. EDA {Univarint}
## 3. EDA{Multivarint}
## 4. Pandas profiler

In [4]:
import  pandas as pd
df = pd.read_csv('titanic_sample_200.csv')

### 1. How big is the data

In [6]:
df.shape

(200, 12)

### 2. How does the look like?

In [11]:
##df.head()
df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
186,187,0,3,Mrs. Anna Brown,female,49.8,3,0,96306,31.51,D112,Q
17,18,0,3,Dr. James Wilson,male,61.9,0,0,22607,17.40,C150,S
182,183,1,3,Dr. James Wilson,female,2.6,2,0,17863,7.29,A137,S
130,131,0,2,Master. Tom Lee,female,18.0,0,3,75969,80.38,C63,S
5,6,1,3,Master. Tom Lee,female,18.7,0,3,25716,42.26,D116,C
114,115,0,1,Master. Tom Lee,female,44.3,3,0,90463,28.55,A59,S
156,157,1,3,Miss. Emily Davis,female,17.0,1,2,20706,21.39,C47,S
181,182,1,2,Master. Tom Lee,female,27.3,0,3,64689,83.96,B15,Q
188,189,0,2,Dr. James Wilson,female,22.1,0,1,37105,93.72,D95,C
197,198,0,3,Miss. Emily Davis,female,48.6,1,0,90463,44.01,C83,C

### 3. What is the data type of cols?

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  200 non-null    int64
 1   Survived     200 non-null    int64
 2   Pclass       200 non-null    int64
 3   Name         200 non-null    object
 4   Sex          200 non-null    object
 5   Age          200 non-null    float64
 6   SibSp        200 non-null    int64
 7   Parch        200 non-null    int64
 8   Ticket       200 non-null    int64
 9   Fare         200 non-null    float64
 10  Cabin        197 non-null    object
 11  Embarked     200 non-null    object
dtypes: float64(2), int64(6), object(4)
memory usage: 18.9+ KB

### 4.Are there any missing values?

In [13]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          3
Embarked       0
dtype: int64

### 5. How does  the data look mathematically?

In [19]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Ticket,Fare
count,200.000000,200.000000,200.000000,200.000000,200.00000,200.000000,200.000000,200.000000
mean,100.500000,0.485000,1.995000,39.746000,1.46500,1.590000,55641.910000,53.378300
std,57.879185,0.501029,0.817506,22.284508,1.12029,1.156976,26432.068531,28.829702
min,1.000000,0.000000,1.000000,1.100000,0.00000,0.000000,10616.000000,5.710000
25%,50.750000,0.000000,1.000000,20.475000,0.00000,1.000000,31252.750000,25.855000
50%,100.500000,0.000000,2.000000,39.450000,1.00000,2.000000,55946.000000,54.545000
75%,150.250000,1.000000,3.000000,58.375000,2.00000,3.000000,78037.000000,78.312500
max,200.000000,1.000000,3.000000,79.600000,3.00000,3.000000,96306.000000,99.900000

### 6. Are there duplicate valueS?

In [15]:
df.duplicated().sum()

np.int64(0)

### 7. Hoe is the correlation between col?

In [21]:
df.corr(numeric_only=True)['Survived']

PassengerId   -0.071307
Survived       1.000000
Pclass        -0.055392
Age           -0.036124
SibSp          0.133350
Parch          0.128038
Ticket         0.030066
Fare          -0.130030
Name: Survived, dtype: float64